---
title: 位图
weight: 3
---

位图不是特殊的数据结构，它的内容其实就是普通的字符串，也就是 **`byte` 数组**。

在日常开发中，可能会有一些 `bool` 型数据需要存取，如果使用普通的 `key/value` 方式存储，会浪费很多存储空间,比如签到记录，签了是 `true`，没签是 `false`，记录 365 天。如果每个用户存储 365 条记录，当用户量很庞大的时候，需要的存储空间是惊人的。

对于这种操作，Redis 提供了位操作，这样每天的签到记录只占据一个位，用 1 表示已签到，0 表示没签，那么 365 天就是 365 个 bit，46 个字节就可以完全容纳下，大大节约了存储空间。

```
11001101010010
```

当我们要统计月活的时候，因为需要去重，需要使用 `set` 来记录所有活跃用户的 id，这非常浪费内存。这时就可以考虑使用位图来标记用户的活跃状态。每个用户会都在这个位图的一个确定位置上，0 表示不活跃，1 表示活跃。然后到月底遍历一次位图就可以得到月度活跃用户数。不过这个方法也是有条件的，那就是 `userid` 是整数连续的（用户 id 对应数组中的 index），并且活跃占比较高，否则可能得不偿失。

## 基本使用

Redis 的位数组是**自动扩展**的，如果设置了某个偏移位置超出了现有的内容范围，就会自动将位数组进行零扩充。

### setbit

设置指定偏移量上的 bit 的值：

```
setbit key offset 0|1
```

- 当 key 不存在时，**自动创建一个新的 key**。
- `offset` 参数的取值范围为大于等于 `0`，小于 `2^32`(bit 映射限制在 `512MB` 以内)。

```bash
redis> setbit testbit 100 1
(integer) 0
redis> getbit testbit 100
(integer) 1
redis> getbit testbit 101
(integer) 0 # bit 默认被初始化为 0
```

### getbit

获取指定偏移量上的 bit 的值：

```bash
redis> exists testbit2
(integer) 0
redis> getbit testbit2 100
(integer) 0
redis> setbit testbit2 100 1
(integer) 0
redis> getbit testbit2 100
(integer) 1
```

**`offset` 比字符串值的长度大，或者 key 不存在时，返回 `0`**。

### 统计和查找

- 统计指令 `bitcount` 用来统计指定位置范围内 1 的个数。
- 查找指令 `bitpos` 用来查找指定范围内出现的第一个 0 或 1。

比如可以通过 `bitcount` 统计用户一共签到了多少天，通过 `bitpos` 指令查找用户从哪一天开始第一次签到。如果指定了范围参数 `[start, end]`，就可以统计在某个时间范围内用户签到了多少天，用户自某天以后的哪天开始签到。